str = "不堪一击0毫不足虑5不足挂齿10初学乍练15勉勉强强20初窥门径25初出茅庐30略知一二35普普通通40平平常常45平淡无奇50粗懂皮毛55半生不熟60登堂入室65略有小成70已有小成75鹤立鸡群80驾轻就熟85青出於蓝90融会贯通95心领神会100炉火纯青105了然於胸110略有大成115已有大成120豁然贯通125非比寻常130出类拔萃135罕有敌手140技冠群雄145神乎其技150出神入化155傲视群雄160登峰造极165无与伦比170所向披靡175一代宗师180精深奥妙185神功盖世190举世无双195惊世骇俗200撼天动地205震古铄今210超凡入圣215威镇寰宇220空前绝后225天人合一230深藏不露235深不可测240返璞归真245"
arr = str.split("")
arr.delete_if {|i| i.ord<="9".ord&&i.ord>="0".ord}
arr1 = []
i=0
while i<=arr.length-1
	arr1.push arr[i,4].join("")
	i += 4
end
id=1
arr1.each do |item|
	puts "insert into bigbang.voc_builder_user_ranks values(#{id},'#{item}',now(),now());"	
	id += 1
end
